#!/bin/bash
##########################################################
#概要 :PostBlogのshow.html.erbファイルの最終行に改行コードを挿入。
#      挿入後、コミット&プッシュを実行
##########################################################
#--------------------------------------------------------------
#変数宣言
#--------------------------------------------------------------
#ルートディレクトリ〜PostBlogまでの絶対パスを記載(自分の環境に合わせて変更してください)
DIR="${HOME}/Desktop/audio-mapping/audio-space"  
#PostBlog〜改行を入れるファイルまでのパスを記載(自分の環境に合わせて変更してください)  
newline_file=""

#--------------------------------------------------------------
#改行付加
#--------------------------------------------------------------
#${HOME}/Ruby/projects/PostBlog/app/views/users/show.html.erbの最終行に改行を挿入
echo "" >>$DIR$newline_file

#--------------------------------------------------------------
#GitHubにコミット&プッシュ
#--------------------------------------------------------------
cd $DIR
git add .
git commit -m"最終行に改行を挿入"
git push origin master
